tutorials/heatTransfer/boussinesqBuoyantFoam/heatedCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          20;
        startFace       760;
    }
    bottom
    {
        type            wall;
        nFaces          20;
        startFace       780;
    }
    left
    {
        type            wall;
        nFaces          20;
        startFace       800;
    }
    right
    {
        type            wall;
        nFaces          20;
        startFace       820;
    }
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          800;
        startFace       840;
    }
)

// ************************************************************************* //
